trade_exp/src/DataProcessors/оп_ЗагрузкаДанныхИзВнешнихФайлов/оп_ЗагрузкаДанныхИзВнешнихФайлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>оп_ЗагрузкаДанныхИзВнешнихФайлов</name>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатЧисло</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопПараметрДата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

trade_exp/src/InformationRegisters/оп_РезультатРасчетаПоказателей/оп_РезультатРасчетаПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>оп_РезультатРасчетаПоказателей</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="0ecb9167-823e-4f24-9f03-182411741ef6">
    <name>РезультатЧисло</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>20</precision>
          <scale>6</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="85a64d22-d699-44a2-9cd4-a8f913f7298c">
    <name>ДатаРасчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7e67949c-7eff-4ac7-ad06-97dde8d9947e">
    <name>Пользователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="775bb22f-9cd8-41c2-b84f-0317758658bb">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="dbdd00e8-1bdb-449a-aa82-ac74b4a6ee63">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="512be237-9443-42aa-8d41-aa7a43c55ad1">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c161122b-e9e4-4968-b28b-cca8c4061310">
    <name>Показатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="1dc3ccb8-3ded-4011-9709-7c20a1b592a9">
    <name>ДопПараметрДата</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/DataProcessors/оп_ЗагрузкаДанныхИзВнешнихФайлов/Forms/Форма/Module.bsl
&НаКлиенте
Перем КэшированныеЗначения; //используется механизмом обработки изменения реквизитов ТЧ

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ИспользоватьХарактеристикиНоменклатуры = Параметры.ИспользоватьХарактеристики;
	ИспользоватьСклады      =   Параметры.ИспользоватьСклады;
	ИспользоватьДату      =   Параметры.ИспользоватьДату;
    ПоказательРасчета  =   Параметры.ПоказательРасчета;
	
	ИнициализироватьТабличныйДокумент();
	УстановитьДоступностьКомандБуфераОбмена();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КопированиеСтрокВБуферОбмена" Тогда
		УстановитьДоступностьКомандБуфераОбменаНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
		Для ТекИндекс = 0 По Объект.Товары.Количество()-1 Цикл
			
			АдресОшибки = НСтр("ru='в строке %НомерСтроки% списка ""Товары""'");
			АдресОшибки = СтрЗаменить(АдресОшибки, "%НомерСтроки%", Объект.Товары[ТекИндекс].НомерСтроки);
			если ИспользоватьСклады и Не ЗначениеЗаполнено(Объект.Товары[ТекИндекс].Склад) тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru='Не заполнена колонка ""Склад""'") + " " + АдресОшибки,
				,
				"Объект." + ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", Объект.Товары[ТекИндекс].НомерСтроки, "Склад"),
				,
				Отказ);
				
			конецесли;
			// Проверка заполнения характеристик.
			Если использоватьХарактеристикиНоменклатуры и Объект.Товары[ТекИндекс].ХарактеристикиИспользуются И Не ЗначениеЗаполнено(Объект.Товары[ТекИндекс].Характеристика) Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru='Не заполнена колонка ""Характеристика""'") + " " + АдресОшибки,
				,
				"Объект." + ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", Объект.Товары[ТекИндекс].НомерСтроки, "Характеристика"),
				,
				Отказ);
				
			КонецЕсли;
			
		КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСБуферомОбмена

&НаСервере
Процедура СкопироватьСтрокиНаСервере()
	
	КопированиеСтрокСервер.ПоместитьВыделенныеСтрокиВБуферОбмена(Элементы.Товары.ВыделенныеСтроки, Объект.Товары);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСтрокиИзБуфераОбмена()
	
	ТаблицаТоваров = КопированиеСтрокСервер.ПолучитьСтрокиИзБуфераОбмена();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьКомандБуфераОбмена()
	
	МассивЭлементов = Новый Массив();
	МассивЭлементов.Добавить("ТоварыВставитьСтроки");
	МассивЭлементов.Добавить("ТоварыКонтекстноеМенюВставитьСтроки");
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
	МассивЭлементов,
	"Доступность", 
	НЕ ОбщегоНазначения.ПустойБуферОбмена("Строки"));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьКомандБуфераОбменаНаКлиенте()
	
	МассивЭлементов = Новый Массив();
	МассивЭлементов.Добавить("ТоварыВставитьСтроки");
	МассивЭлементов.Добавить("ТоварыКонтекстноеМенюВставитьСтроки");
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, МассивЭлементов, "Доступность", Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ПоискИСопоставлениеНоменклатуры

&НаСервере
Процедура СопоставитьДанныеТабличногоДокументаСДаннымиИБ()
	
	Объект.Товары.Очистить();
	
	НомераКолонок = Новый Соответствие;
	НомерКолонки = 1;
	
	НомераКолонок.Вставить("КолонкаКод", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	НомерКолонки = НомерКолонки +1;
	НомераКолонок.Вставить("КолонкаНоменклатура", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	НомерКолонки = НомерКолонки +1;
	Если ИспользоватьХарактеристикиНоменклатуры Тогда
		НомераКолонок.Вставить("КолонкаХарактеристика", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
		НомерКолонки = НомерКолонки +1;
	КонецЕсли;
	Если использоватьСклады Тогда
		НомераКолонок.Вставить("КолонкаСклад", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
		НомерКолонки = НомерКолонки +1;
	КонецЕсли;
	Если использоватьдату Тогда
		НомераКолонок.Вставить("КолонкаДата", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
		НомерКолонки = НомерКолонки +1;
	КонецЕсли;
	НомераКолонок.Вставить("КолонкаРезультат", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	НомерКолонки = НомерКолонки +1;
	
	НомерСтроки = 2;
	СтроковыйНомер = Формат(НомерСтроки, "ЧН=0; ЧГ=0");
	ЗаполненыДанныеСтроки = ложь;
	для к=1 по НомерКолонки цикл
		если ЗначениеЗаполнено(ТабличныйДокумент.Область("R" + СтроковыйНомер + "C" + Формат(к, "ЧН=0; ЧГ=0")).Текст) тогда
			ЗаполненыДанныеСтроки = истина;
			прервать;
		конецесли;	
		
	конеццикла;	
	
	ЕстьОшибкиРаспознавания = Ложь;
	Пока ЗаполненыДанныеСтроки Цикл
		НоваяСтрокаТовары = Объект.Товары.Добавить();
		ИмяСтроки = "R" + Формат(НомерСтроки, "ЧН=0; ЧГ=0");
		КодСтр=ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаКод")).Текст;
		НоваяСтрокаТовары.ЗагружаемыйКод             = КодСтр;
		НоменклатураСтр=ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаНоменклатура")).Текст;
		НоваяСтрокаТовары.ЗагружаемаяНоменклатура    = НоменклатураСтр;
		НоваяСтрокаТовары.Номенклатура            = ВернутьСсылкуОбъекта("Номенклатура",Новый Структура("Код,Наименование",Кодстр,НоменклатураСтр));;
		
		Если использоватьСклады Тогда
			СкладСтр=ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаСклад")).Текст;
			НоваяСтрокаТовары.ЗагружаемыйСклад        	 = СкладСтр;
			НоваяСтрокаТовары.Склад        	 = ВернутьСсылкуОбъекта("Склады",Новый Структура("Наименование",СкладСтр));;;
		конецесли;
		
		Если использоватьХарактеристикиНоменклатуры Тогда
			ХарактеристикаСтр=ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаХарактеристика")).Текст;
			НоваяСтрокаТовары.ЗагружаемаяХарактеристика        	 = ХарактеристикаСтр;
			НоваяСтрокаТовары.Склад        	 = ВернутьСсылкуОбъекта("ХарактеристикаСтр",Новый Структура("Владелец,Наименование",НоваяСтрокаТовары.Номенклатура,ХарактеристикаСтр));;;
			если значениезаполнено(НоваяСтрокаТовары.Номенклатура) тогда
				НоваяСтрокаТовары.ХарактеристикиИспользуются=НоваяСтрокаТовары.Номенклатура.ИспользованиеХарактеристик;
			конецесли;	
		конецесли;	
		Если использоватьдату Тогда
			ДатаСтр=ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаДата")).Текст;
			НоваяСтрокаТовары.ДопПараметрДата=ВернутьДатуИзЗначенияЯчейки(ТабличныйДокумент, ИмяСтроки, НомераКолонок.Получить("КолонкаДата"), "ДопПараметрДата");
		конецесли;	
		Результат = ВернутьЧислоИзЗначенияЯчейки(ТабличныйДокумент, ИмяСтроки, НомераКолонок.Получить("КолонкаРезультат"), "Результат");
		НоваяСтрокаТовары.РезультатЧисло            = Результат;
		
		НомерСтроки = НомерСтроки + 1;
		СтроковыйНомер = Формат(НомерСтроки, "ЧН=0; ЧГ=0");
		
		ЗаполненыДанныеСтроки = ложь;
		для к=1 по НомерКолонки цикл
			если ЗначениеЗаполнено(ТабличныйДокумент.Область("R" + СтроковыйНомер + "C" + Формат(к, "ЧН=0; ЧГ=0")).Текст) тогда
				ЗаполненыДанныеСтроки = истина;
				прервать;
			конецесли;	
		конеццикла;	
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ВернутьСсылкуОбъекта(ИмяСправочника,ПараметрыПоиска)
	НайденныйОбъект = Справочники[ИмяСправочника].ПустаяСсылка();
	Если ПараметрыПоиска.Свойство("Код") Тогда
		Если ПараметрыПоиска.Свойство("Владелец") тогда
			НайденныйОбъект=Справочники[ИмяСправочника].НайтиПоКоду(ПараметрыПоиска.код,,,ПараметрыПоиска.Владелец);	
		Иначе
			НайденныйОбъект=Справочники[ИмяСправочника].НайтиПоКоду(ПараметрыПоиска.код);
		Конецесли;
	ИначеЕсли Параметрыпоиска.свойство("Наименование") Тогда
		Если Параметрыпоиска.свойство("Владелец") Тогда
			НайденныйОбъект=Справочники[ИмяСправочника].НайтиПоНаименованию(ПараметрыПоиска.Наименование,Истина,,ПараметрыПоиска.Владелец);
		Иначе
			НайденныйОбъект=Справочники[ИмяСправочника].НайтиПоНаименованию(ПараметрыПоиска.Наименование,Истина);
		Конецесли;
	Конецесли;
	Возврат НайденныйОбъект;
	
КонецФункции

&НаСервере
Функция ВернутьЧислоИзЗначенияЯчейки(ТабличныйДокумент, ИмяСтроки, Колонка, ИмяКолонки)
	Строка = ВернутьЗначениеЯчейкиПоУсловияю(ТабличныйДокумент, ИмяСтроки, Колонка);
	Если Строка <> "" Тогда
		Попытка
			Возврат Число(Строка);
		Исключение
			Сообщить("В строке " + Прав(ИмяСтроки, СтрДлина(ИмяСтроки) - 1) + " некорректно заполнено поле """ + ИмяКолонки + """. Значение изменено на 0.");
			Возврат 0;
		КонецПопытки;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

&НаСервере
Функция ВернутьДатуИзЗначенияЯчейки(ТабличныйДокумент, ИмяСтроки, Колонка, ИмяКолонки)
	Строка = ВернутьЗначениеЯчейкиПоУсловияю(ТабличныйДокумент, ИмяСтроки, Колонка);
	Если Строка <> "" Тогда
		Попытка
			если стрДлина(строка)<=10 тогда
				Строка=Строка+" 00:00:00";
			конецесли;	
			Возврат Дата(Строка);
		Исключение
			Сообщить("В строке " + Прав(ИмяСтроки, СтрДлина(ИмяСтроки) - 1) + " некорректно заполнено поле """ + ИмяКолонки + """.");
			Возврат "";
		КонецПопытки;
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции

&НаСервере
Функция ВернутьЗначениеЯчейкиПоУсловияю(ТД, ИмяСтроки, ИмяКолонки)
	Если ЗначениеЗаполнено(ИмяКолонки) Тогда
		Возврат СокрЛП(ТД.Область(ИмяСтроки + ИмяКолонки).Текст);
	КонецЕсли;
	Возврат "";
КонецФункции

#КонецОбласти

#Область Прочее

&НаСервере
Процедура ИнициализироватьТабличныйДокумент()
	
	МакетЗаполненияПоВнешнемуИсточнику = Обработки.оп_ЗагрузкаДанныхИзВнешнихФайлов.ПолучитьМакет("МакетЗагрузкиДанных");
	ТабличныйДокумент.Очистить();
	
	ОбластьТовары = МакетЗаполненияПоВнешнемуИсточнику.ПолучитьОбласть("Код");
	ТабличныйДокумент.Присоединить(ОбластьТовары);
	ОбластьТовары = МакетЗаполненияПоВнешнемуИсточнику.ПолучитьОбласть("Номенклатура");
	ОбластьТовары.Параметры.ЗаголовокТоварноеМесто = НСтр("ru='Номенклатура'");
	ТабличныйДокумент.Присоединить(ОбластьТовары);
	Если ИспользоватьХарактеристикиНоменклатуры Тогда
		ОбластьТовары = МакетЗаполненияПоВнешнемуИсточнику.ПолучитьОбласть("Характеристика");
		ТабличныйДокумент.Присоединить(ОбластьТовары);
	КонецЕсли;
	
	Если ИспользоватьСклады Тогда
		ОбластьТовары = МакетЗаполненияПоВнешнемуИсточнику.ПолучитьОбласть("Склад");
		ТабличныйДокумент.Присоединить(ОбластьТовары);
	КонецЕсли;
	
	Если ИспользоватьДату Тогда
		ОбластьТовары = МакетЗаполненияПоВнешнемуИсточнику.ПолучитьОбласть("Дата");
		ТабличныйДокумент.Присоединить(ОбластьТовары);
	КонецЕсли;
	ОбластьТовары = МакетЗаполненияПоВнешнемуИсточнику.ПолучитьОбласть("Результат");
	ТабличныйДокумент.Присоединить(ОбластьТовары);
	
	ТабличныйДокумент.ФиксацияСверху = 1;
	
КонецПроцедуры
                                                                                                                          
&НаСервере
Процедура УстановитьДоступностьКолонок()
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
	"ТоварыЗагружаемаяХарактеристика", 
	"Видимость", 
	ИспользоватьХарактеристикиНоменклатуры);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)
	ЗаполненыНоменклатураКодАртикулШтрихкод = ЗначениеЗаполнено(ТабличныйДокумент.Область("R2C1").Текст)
	Или ЗначениеЗаполнено(ТабличныйДокумент.Область("R2C2").Текст);
	
	Если Не ЗаполненыНоменклатураКодАртикулШтрихкод Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Необходимо скопировать колонки в таблицу из внешнего файла.'"));
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	Состояние(НСтр("ru = 'Осуществляется сопоставление введенных данных с данными информационной базы. Пожалуйста подождите...'"),,,БиблиотекаКартинок.Информация32);
	СопоставитьДанныеТабличногоДокументаСДаннымиИБ();
	
	Элементы.Шаги.ТекущаяСтраница = Элементы.Шаг2;
	УстановитьВидимостьКолонок();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьКолонок()
	Элементы.ТоварыЗагружаемаяХарактеристика.Видимость=ИспользоватьХарактеристикиНоменклатуры;
	Элементы.ТоварыХарактеристика.Видимость=ИспользоватьХарактеристикиНоменклатуры;
	Элементы.ТоварыЗагружаемыйСклад.Видимость=ИспользоватьСклады;
	Элементы.ТоварыСклад.Видимость=ИспользоватьСклады;
	Элементы.ТоварыЗагружаемаяДата.Видимость=ИспользоватьДату;
	Элементы.ТоварыДопПараметрДата.Видимость=ИспользоватьДату;
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	Элементы.Шаги.ТекущаяСтраница = Элементы.Шаг1;
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиТовары(Команда)
	ОчиститьСообщения();
	ПеренестиТоварыФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиТоварыФрагмент()
	Перем СтруктураВыбора;
	
	Если ПроверитьЗаполнение() Тогда
		ЗаписатьПоказатели();
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПоказатели()
   РегистрыСведений.оп_РезультатРасчетаПоказателей.ЗаписатьПоказателиРегистраТаблица(Объект.Товары.Выгрузить(),ПоказательРасчета);
КонецПроцедуры

&НаКлиенте
Процедура ВставитьСтроки(Команда)
	КоличествоТоваровДоВставки = Объект.Товары.Количество();
	
	ПолучитьСтрокиИзБуфераОбмена();
	
	КоличествоВставленных = Объект.Товары.Количество()-КоличествоТоваровДоВставки;
	КопированиеСтрокКлиент.ОповеститьПользователяОВставкеСтрок(КоличествоВставленных);
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьСтроки(Команда)
	
	Если КопированиеСтрокКлиент.ВозможноКопированиеСтрок(Элементы.Товары.ТекущаяСтрока) Тогда
		СкопироватьСтрокиНаСервере();
		КопированиеСтрокКлиент.ОповеститьПользователяОКопированииСтрок(Элементы.Товары.ВыделенныеСтроки.Количество());
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Отметка незаполненной характеристики, если форма открыта с параметром ПроверятьЗаполнениеХарактеристик = Истина.
	Если Параметры.Свойство("ПроверятьЗаполнениеХарактеристик") И Параметры.ПроверятьЗаполнениеХарактеристик Тогда
		
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		
		ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыХарактеристика.Имя);
		
		ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ХарактеристикиИспользуются");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
		
	КонецЕсли;
	
	НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ЭтаФорма);

	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыХарактеристика.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыЗагружаемаяХарактеристика.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ИспользоватьХарактеристикиНоменклатуры");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
КонецПроцедуры

#КонецОбласти
